Revit 2026 API
NurbSpline.CreateCurve Method
Overload List
Name | Description
CreateCurve(HermiteSpline) |  Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc.
CreateCurve(IList<XYZ>, IList<Double>)
CreateCurve(Int32, IList<Double>, IList<XYZ>)
CreateCurve(Int32, IList<Double>, IList<XYZ>, IList<Double>)
Top
See Also
Reference
NurbSpline Class
Autodesk.Revit.DB Namespace